In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [5]:
d1=pd.DataFrame(dict1)

In [6]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [7]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [8]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [9]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [10]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number this applicable for numerical columns only

- generally data has some empty rows

- it is a data problem

- if you read that kind of data you will see Null

- you need to understand it is a data corrupted or really a Null values are there

**Method-1**

**Fill with some random value**

**Method name**:fill na

In [11]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**Method-2**

- we can fill the values w.r.t columns also

In [12]:
d1['Age'].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [13]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [14]:
d1['Age'].fillna(40,inplace=True)

In [15]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [16]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [17]:
d1.fillna(method='bfill')
# it will fill with below value or next value
# column1: names index 3 is missing values it is filled with index 4 value
# column2: age index 1 is missing values it is filled with index 2 value
# column3: city index 4 is missing values it should be fill with next value
#

C:\Users\HP\AppData\Local\Temp\ipykernel_24552\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [18]:
d1.fillna(method='bfill',axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_24552\981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [19]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

- backfill and bill fill with Next value

- pad and ffill fill with previous value

- but it will change based on axis

In [ ]:
**Method-4**

- mean

    - numerical values can fill with mean value

    - but mean affect by outliers

    - if we dont have outliers it is best one

- median

    - numerical values can fill with median value

    - we know that median value

In [21]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [22]:
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [23]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [24]:
d1['City'].mode()

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

**Method-5**

**KNN imputer**

- KNN: K nearest neighbours

- K is a hyper parameter means user can choose

- it is distance metric: **Euclidian distance**

- KNN imputer will take the mean of the neighbours value

- the neighbours value can provided by using value=k

- it is under sklearn package

- under sklearn we have imputer method

- under imputer method we have KnnImputer

- applicable only for numerical data

In [25]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])